Белгипрозем_2017/src/Documents/ВходящееПисьмо/ВходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВходящееПисьмо</name>
  <posting>Deny</posting>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдресат</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаПростойТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаРазмеченныйТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтправительКонтакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтправительОтображаемоеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПолучателиКопийСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПолучателиПисьмаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресаУведомленияОПрочтении</name>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Корреспонденты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Корреспонденты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Корреспонденты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Корреспонденты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/HTMLПредставленияСодержанияПисем/HTMLПредставленияСодержанияПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>HTMLПредставленияСодержанияПисем</name>
  <resources>
    <name>ТекстHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ТипыТекстовПочтовыхСообщений/ТипыТекстовПочтовыхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовПочтовыхСообщений</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/ВходящееПисьмо/ManagerModule.bsl
// УправлениеДоступом

// Возвращает строку, содержащую перечисление полей доступа через запятую
// Это перечисление используется в дальнейшем для передачи в метод 
// ОбщегоНазначения.ПолучитьЗначенияРеквизитов()
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Папка, УчетнаяЗапись";
	
КонецФункции

// Заполняет переданный дескриптор доступа
//
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДескрипторДоступа.УчетнаяЗаписьПочты = ОбъектДоступа.УчетнаяЗапись;
	ДескрипторПапки = РегистрыСведений.ДескрипторыДоступаДляОбъектов.НайтиДескрипторДляОбъекта(
		ОбъектДоступа.Папка);
	Если ЗначениеЗаполнено(ДескрипторПапки) Тогда
		ДескрипторДоступа.ДескрипторВладельца = ДескрипторПапки;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает Истина, указывая тем самым что этот объект сам заполняет свои права
//
Функция ЕстьМетодЗаполнитьПраваДоступа() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Заполняет параметр ПраваДоступа правами доступа, вычисляя их на
// основании переданного дескриптора доступа.
// Если указан параметр ПротоколРасчетаПрав, то в него
// заносится список данных, которые были использованы для расчета прав.
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	ВстроеннаяПочтаСервер.ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав);
	
КонецПроцедуры

// Конец УправлениеДоступом

// Возвращает текст письма в виде HTML.
Функция ПолучитьHTMLПредставлениеСодержанияПисьма(РеквизитыПисьма) Экспорт
	
	ТекстHTML = "";
	
	Если РеквизитыПисьма.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.HTML Тогда
		
		ТекстHTML = РегистрыСведений.HTMLПредставленияСодержанияПисем.Прочитать(РеквизитыПисьма.Ссылка);
		
		Если ТекстHTML = Неопределено Тогда
			
			ТекстHTML = РеквизитыПисьма.ТекстПисьмаHTMLХранилище.Получить();
			
			Если ТекстHTML = Неопределено Тогда
				ТекстHTML = "";
			Иначе
				
				ОбрезатьСлишкомДлинныйТекст(ТекстHTML);
				
				РаботаС_HTML.ДобавитьТегиКСсылкам(ТекстHTML);
				
				РегистрыСведений.HTMLПредставленияСодержанияПисем.Записать(РеквизитыПисьма.Ссылка, ТекстHTML);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстHTML = РегистрыСведений.HTMLПредставленияСодержанияПисем.Прочитать(РеквизитыПисьма.Ссылка);
		
		Если ТекстHTML = Неопределено Тогда
			
			ПростойТекст = РеквизитыПисьма.ТекстПисьмаПростойТекстХранилище.Получить();
			
			Если ПростойТекст = Неопределено Тогда
				
				ТекстHTML = "";
				
			Иначе
				
				ТекстHTML = РаботаС_HTML.ПолучитьHTMLИзТекста(ПростойТекст, РеквизитыПисьма.Кодировка);
				
				ОбрезатьСлишкомДлинныйТекст(ТекстHTML);
				
				РаботаС_HTML.ДобавитьТегиКСсылкам(ТекстHTML);
				
				РегистрыСведений.HTMLПредставленияСодержанияПисем.Записать(РеквизитыПисьма.Ссылка, ТекстHTML);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(НРег(РеквизитыПисьма.ВнутреннийЗаголовок), "text/calendar") > 0 Тогда 
		ContentType = ВстроеннаяПочтаСервер.ПолучитьЗначениеПоляИзЗаголовкаПисьма(РеквизитыПисьма.ВнутреннийЗаголовок, "Content-Type");
		Если Найти(НРег(ContentType), "text/calendar") > 0 И Найти(ТекстHTML, "BEGIN:VCALENDAR") <> 0 Тогда 
			// формат iCalendar
			ТекстHTML = СформироватьТекстПриглашения(ТекстHTML, РеквизитыПисьма.Тема);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ТекстHTML;
	
КонецФункции

// Возвращает имя предмета процесса по умолчанию
//
Функция ПолучитьИмяПредметаПоУмолчанию(Ссылка) Экспорт
	
	Возврат НСтр("ru='Входящее письмо'");
	
КонецФункции

Процедура ОбрезатьСлишкомДлинныйТекст(ТекстHTML)
	
	МаксимальнаяДлина = 1500000; // 1.5 Мб
	ДлинаТекста = СтрДлина(ТекстHTML);
	Если ДлинаТекста > МаксимальнаяДлина Тогда
		
		РазмерВМб = ДлинаТекста/(1024*1024);
		
		ТекстHTML = Лев(ТекстHTML, МаксимальнаяДлина);
		ТекстHTML = ТекстHTML + 
			+ Символы.ПС + "<hr>" + "<p>" + "<font color=""red"">"
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Т.к. содержание письма очень большое (%1 Мб), показана только часть письма. 
			|Для просмотра всего содержания письма используйте команду <b>""Сохранить письмо"" (Alt-S)</b> 
			|для сохранения и последующего просмотра содержания письма.'"),
			ФайловыеФункцииКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМб))
			+ "</font>" + "</p>" + "</body>" + "</html>";
			
	КонецЕсли;	
	
КонецПроцедуры	

Функция СформироватьТекстПриглашения(ТекстHTML, Тема)
	
	ТолькоТекст = РаботаС_HTML.ПолучитьТекстИзHTML(ТекстHTML);
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТолькоТекст, Символы.ВК + Символы.ПС);
	ПараметрыКалендаря = Новый Соответствие;
	
	ОписаниеУжеБыло = Ложь;
	УчастникиСтрокой = "";
	
	ТекстОписания = "";
	НачалосьОписание = Ложь;
	
	Для Каждого Строка Из МассивСтрок Цикл
		
		СтрокаКалендаря = Строка;
		
		Если НачалосьОписание Тогда
			
			ЭтоНачалоПоля = Истина;
			БылиДопустимыеСимволы = Ложь;
			
			ПервыйСимволДопустимый = Ложь;
			Если СтрокаКалендаря <> "" Тогда
				Символ = Лев(СтрокаКалендаря, 1);
				ПервыйСимволДопустимый = ЭтоДопустимыйСимвол(Символ);
			КонецЕсли;	
			
			Для Поз = 0 По СтрДлина(СтрокаКалендаря) Цикл
				
				Символ = Сред(СтрокаКалендаря, Поз + 1 , 1);
				
				Если Не ЭтоДопустимыйСимвол(Символ) Тогда
					
					// корректное начало нового поля - сперва допустимый символ (не пробел),
					// потом все заглавные латинские, потом ";" или ":"
					// тут проверка на инверсию этого условия
					Если Не ПервыйСимволДопустимый Или Не БылиДопустимыеСимволы Или (Символ <> ":" И Символ <> ";") Тогда
					
						ЭтоНачалоПоля = Ложь;
						
					КонецЕсли;	
					
					Прервать;
					
				Иначе
					БылиДопустимыеСимволы = Истина;				
				КонецЕсли;	
				
			КонецЦикла;	
			
			Если Не БылиДопустимыеСимволы Тогда
				ЭтоНачалоПоля = Ложь;
			КонецЕсли;	
			
			Если ЭтоНачалоПоля Тогда
				НачалосьОписание = Ложь;
			Иначе
				ТекстОписания = ТекстОписания + СтрокаКалендаря;
			КонецЕсли;	
			
		КонецЕсли;	
		
		Если Найти(ВРег(СтрокаКалендаря), ВРег("ATTENDEE")) = 1 Тогда // ATTENDEE в начале
			
			МассивСтрокПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКалендаря, ";");
			Для Каждого СтрокаВПоле Из МассивСтрокПоля Цикл
				
				Если Найти(ВРег(СтрокаВПоле), ВРег("CN=")) = 1 Тогда
					
					ИмяУчастника = Сред(СтрокаВПоле, СтрДлина("CN=") + 1);
					Если Не ПустаяСтрока(УчастникиСтрокой) Тогда
						УчастникиСтрокой = УчастникиСтрокой + "; ";
					КонецЕсли;	
					УчастникиСтрокой = УчастникиСтрокой + ИмяУчастника;
					Прервать;
					
				ИначеЕсли Найти(ВРег(СтрокаВПоле), ВРег("RSVP=")) = 1 Тогда	
					
					ПозицияMailto = Найти(ВРег(СтрокаВПоле), ВРег("MAILTO:"));
					Если ПозицияMailto <> 0 Тогда	
						
						АдресУчастника = Сред(СтрокаВПоле, ПозицияMailto + СтрДлина("MAILTO:"));
						Адресат = ВстроеннаяПочтаСерверПовтИсп.ПолучитьПочтовогоАдресата(АдресУчастника, "");
						ИмяУчастника = Строка(Адресат);
						
						Если Не ПустаяСтрока(УчастникиСтрокой) Тогда
							УчастникиСтрокой = УчастникиСтрокой + "; ";
						КонецЕсли;	
						
						УчастникиСтрокой = УчастникиСтрокой + ИмяУчастника;
						Прервать;
						
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли;	
		
		ПозицияДвоеточия = Найти(СтрокаКалендаря, ":");
		Если ПозицияДвоеточия <> 0 И Не НачалосьОписание Тогда
			ИмяПоля = Лев(СтрокаКалендаря, ПозицияДвоеточия - 1);
			ЗначениеПоля = Сред(СтрокаКалендаря, ПозицияДвоеточия + 1);
			
			Если Не ПустаяСтрока(ИмяПоля) Тогда
				
				Если ВРег(ИмяПоля) = ВРег("DESCRIPTION") Тогда
					Если ОписаниеУжеБыло Тогда
						Продолжить;
					Иначе
						ОписаниеУжеБыло = Истина;
						ТекстОписания = ЗначениеПоля;
						НачалосьОписание = Истина;
					КонецЕсли;	
				КонецЕсли;	
				
				Если Найти(ВРег(ИмяПоля), ВРег("DTSTART")) = 1 Тогда // DTSTART в начале
					
					СтрокаДаты = ЗначениеПоля;
					СтрокаДаты = СтрЗаменить(СтрокаДаты, "T", "");
					
					ЭтоВремяВUTC = Ложь;
					Если Найти(СтрокаДаты, "Z") <> 0 Тогда
						ЭтоВремяВUTC = Истина;
					КонецЕсли;
					
					СтрокаДаты = СтрЗаменить(СтрокаДаты, "Z", "");
					
					Попытка
						ДатаНачала = Дата(СтрокаДаты);
						Если ЭтоВремяВUTC Тогда
							ДатаНачала = МестноеВремя(ДатаНачала);
						КонецЕсли;	
						
						ЗначениеПоля = ДатаНачала;
						ИмяПоля = "DTSTART";
					Исключение
						Продолжить;
					КонецПопытки;
					
				КонецЕсли;	
				
				Если Найти(ВРег(ИмяПоля), ВРег("DTEND")) = 1 Тогда // DTEND в начале
					
					СтрокаДаты = ЗначениеПоля;
					СтрокаДаты = СтрЗаменить(СтрокаДаты, "T", "");
					
					ЭтоВремяВUTC = Ложь;
					Если Найти(СтрокаДаты, "Z") <> 0 Тогда
						ЭтоВремяВUTC = Истина;
					КонецЕсли;
					
					СтрокаДаты = СтрЗаменить(СтрокаДаты, "Z", "");
					
					Попытка
						ДатаКонца = Дата(СтрокаДаты);
						Если ЭтоВремяВUTC Тогда
							ДатаКонца = МестноеВремя(ДатаКонца);
						КонецЕсли;	
						
						ЗначениеПоля = ДатаКонца;
						ИмяПоля = "DTEND";
					Исключение
						Продолжить;
					КонецПопытки;
					
				КонецЕсли;	
				
				Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда
					ЗначениеПоля = СтрЗаменить(ЗначениеПоля, "\n", "<br>");
				КонецЕсли;	
				
				ПараметрыКалендаря[ИмяПоля] = ЗначениеПоля;
				
			КонецЕсли;	
			
		КонецЕсли;			
		
	КонецЦикла;				
	
	ТекстОписания = СтрЗаменить(ТекстОписания, "\n", "<br>");
	
	Название = Тема; 
	Место = ПараметрыКалендаря["LOCATION"];
	КогдаНачало = ПараметрыКалендаря["DTSTART"];
	КогдаКонец = ПараметрыКалендаря["DTEND"];
	Описание = ТекстОписания;
	Участники = УчастникиСтрокой;
	
	МассивПолей = Новый Массив;
	МассивПолей.Добавить(Новый Структура("Имя,Значение", НСтр("ru='Название'"), Название));
	Если Место <> Неопределено Тогда
		МассивПолей.Добавить(Новый Структура("Имя,Значение", НСтр("ru='Место'"), Место));
	КонецЕсли;	
	
	Если КогдаКонец = Неопределено Тогда
		
		МассивПолей.Добавить(Новый Структура("Имя,Значение", НСтр("ru='Время'"), 
			Формат(КогдаНачало, "ДФ='dd.MM.yyyy hh:mm'")));
		
	ИначеЕсли КогдаНачало <> Неопределено И КогдаКонец <> Неопределено Тогда
		
		СтрокаДаты = "";
		
		Если НачалоДня(КогдаНачало) = НачалоДня(КогдаКонец) Тогда
			СтрокаДаты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 - %2",
				Формат(КогдаНачало, "ДФ='dd.MM.yyyy hh:mm'"), 
				Формат(КогдаКонец, "ДФ='hh:mm'"));
		Иначе	
			СтрокаДаты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 - %2",
				Формат(КогдаНачало, "ДФ='dd.MM.yyyy hh:mm'"), 
				Формат(КогдаКонец, "ДФ='dd.MM.yyyy hh:mm'"));
		КонецЕсли;	
		
		МассивПолей.Добавить(Новый Структура("Имя,Значение", НСтр("ru='Время'"), СтрокаДаты));
			
	КонецЕсли;	
	
	МассивПолей.Добавить(Новый Структура("Имя,Значение", НСтр("ru='Участники'"), Участники));
	Если Описание <> Неопределено Тогда
		МассивПолей.Добавить(Новый Структура("Имя,Значение", НСтр("ru='Описание'"), Описание));
	КонецЕсли;	
	
	ТекстHTML = НСтр("ru='<h3>Приглашение</h3>'");
	
	Для Каждого Поле Из МассивПолей Цикл
		СтрокаHTML = "<b>" + Поле.Имя + "</b>:&nbsp;" + Поле.Значение + "<br>";
		ТекстHTML = ТекстHTML + СтрокаHTML + Символы.ВК;
	КонецЦикла;
	
	ВстроеннаяПочтаСервер.ДобавитьНеобходимыеТэгиHTML(ТекстHTML);
	
	Возврат ТекстHTML;
	
КонецФункции	

Функция ЭтоДопустимыйСимвол(Символ)
	
	ДопустимыеСимволы = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Если Найти(ДопустимыеСимволы, Символ) = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Тема");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='%1 от %2'"), Данные.Тема, Строка(Данные.Дата));
	
КонецПроцедуры
